In [2]:
import pandas as pd

# String methods: working with text

### in base Python

combine:

In [1]:
'wood' + 'chuck'

'woodchuck'

subset:

In [4]:
'woodchuck'[4:]

'chuck'

In [5]:
'woodchuck'[-5:]

'chuck'

change case:

In [6]:
'giraffe'.title()

'Giraffe'

In [7]:
'Antelope'.lower()

'antelope'

In [8]:
'gazelle'.upper()

'GAZELLE'

contains substring:

In [11]:
'wood' in 'woodchuck'

True

insert variables into strings:

In [12]:
animal = 'penguin'

In [14]:
'my favorite animal is a ' + animal

'my favorite animal is a penguin'

using _f-strings_:

In [17]:
f"Many types of {animal}s are fast swimmers"

'Many types of penguins are fast swimmers'

## in `pandas`

In [19]:
pluto = pd.read_csv('https://raw.githubusercontent.com/dlevine01/urban-data-analysis-course/refs/heads/main/Data/Source%20Data/Primary_Land_Use_Tax_Lot_Output__PLUTO__20250124.csv')

In [21]:
pluto.head()

,borough,Tax block,Tax lot,community board,census tract 2010,cb2010,schooldist,council district,postcode,firecomp,...,landmkdate,basempdate,masdate,polidate,edesigdate,geom,dcpedited,notes,bct2020,bctcb2020
0,MN,1393,4,108,142.0,4001,2.0,4,10075.0,E022,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1014200,10142004001
1,MN,1466,144,108,124.0,3000,2.0,5,10021.0,L016,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1012400,10124003000
2,MN,1467,1,108,124.0,2000,2.0,5,10021.0,E044,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1012400,10124002001
3,MN,1467,44,108,124.0,2000,2.0,5,10021.0,E044,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1012400,10124002001
4,MN,1467,5,108,124.0,2000,2.0,5,10021.0,E044,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1012400,10124002000

Access [extra string methods](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.html) of a series with `.str`

substrings:

In [22]:
pluto['zonedist1']

0        R10
1       R10A
2       R10A
3        R8B
4       R10A
        ...
5481     NaN
5482    C1-9
5483     R8B
5484     R8B
5485     R8B
Name: zonedist1, Length: 5486, dtype: object

In [23]:
pluto['zonedist1'].str.slice(stop=1)

0         R
1         R
2         R
3         R
4         R
       ...
5481    NaN
5482      C
5483      R
5484      R
5485      R
Name: zonedist1, Length: 5486, dtype: object

search for substring:

In [30]:
pluto['address'].str.contains('AVENUE')

0        True
1       False
2        True
3       False
4       False
        ...
5481    False
5482     True
5483    False
5484    False
5485    False
Name: address, Length: 5486, dtype: object

In [34]:
pluto['ownername'].str.contains('LLC')

0       False
1       False
2       False
3       False
4        True
        ...
5481    False
5482    False
5483    False
5484     True
5485     True
Name: ownername, Length: 5486, dtype: object

split:

In [32]:
pluto['address'].str.split(' ')

0              [971, 5, AVENUE]
1       [402, EAST, 72, STREET]
2             [1344, 1, AVENUE]
3       [404, EAST, 73, STREET]
4       [405, EAST, 72, STREET]
                 ...
5481    [412, EAST, 79, STREET]
5482          [1501, 1, AVENUE]
5483               [FDR, DRIVE]
5484    [169, EAST, 64, STREET]
5485    [214, EAST, 74, STREET]
Name: address, Length: 5486, dtype: object

In [49]:
pluto['address'].str.split(' ', n=1, expand=True)

         0               1
0      971        5 AVENUE
1      402  EAST 72 STREET
2     1344        1 AVENUE
3      404  EAST 73 STREET
4      405  EAST 72 STREET
...    ...             ...
5481   412  EAST 79 STREET
5482  1501        1 AVENUE
5483   FDR           DRIVE
5484   169  EAST 64 STREET
5485   214  EAST 74 STREET

[5486 rows x 2 columns]

(advanced: extract with a _regex_ search pattern)

In [70]:
pluto['address'].str.extract(pat=r'(\d+)')

         0
0      971
1      402
2     1344
3      404
4      405
...    ...
5481   412
5482  1501
5483   NaN
5484   169
5485   214

[5486 rows x 1 columns]

reformat:

In [47]:
pluto['ownername'].str.title()

0                              Republic Of France
1                  Royal Charter Properties, Inc.
2              399 East 72Nd Apartment Owners Inc
3                           999 First Corporation
4                                  Elliana 72 Llc
                          ...
5481                            Unavailable Owner
5482                          1501 First Equities
5483    Nyc Department Of Small Business Services
5484                         169 East 64Th St Llc
5485                         Monolith Capital Llc
Name: ownername, Length: 5486, dtype: object

replace:

In [38]:
pluto['borough'].replace('MN','Manhattan')

0       Manhattan
1       Manhattan
2       Manhattan
3       Manhattan
4       Manhattan
          ...
5481    Manhattan
5482    Manhattan
5483    Manhattan
5484    Manhattan
5485    Manhattan
Name: borough, Length: 5486, dtype: object

zero-pad:

In [43]:
pluto['Tax block'].astype(str).str.zfill(5)

0       01393
1       01466
2       01467
3       01467
4       01467
        ...
5481    01473
5482    01453
5483    01488
5484    01399
5485    01428
Name: Tax block, Length: 5486, dtype: object

combine:

In [ ]:
# create BBL from borough, block, and lot

(
    pluto['borocode'].astype(str)
    +
    pluto['Tax block'].astype(str).str.zfill(5)
    +
    pluto['Tax lot'].astype(str).str.zfill(4)
)

0       1013930004
1       1014660144
2       1014670001
3       1014670044
4       1014670005
           ...
5481    1014739042
5482    1014530025
5483    1014880060
5484    1013990027
5485    1014280041
Length: 5486, dtype: object

In [48]:
# see, it matches:

pluto['BBL']

0       1013930004
1       1014660144
2       1014670001
3       1014670044
4       1014670005
           ...
5481    1014739042
5482    1014530025
5483    1014880060
5484    1013990027
5485    1014280041
Name: BBL, Length: 5486, dtype: int64

extract substring:

In [ ]:
# tax block from BBL

pluto['BBL'].astype(str).str.slice(start=1, stop=5)

0       0139
1       0146
2       0146
3       0146
4       0146
        ...
5481    0147
5482    0145
5483    0148
5484    0139
5485    0142
Name: BBL, Length: 5486, dtype: object

## handling nulls

In [72]:
pluto['numfloors'].isna()

0        True
1       False
2       False
3       False
4       False
        ...
5481     True
5482    False
5483     True
5484    False
5485    False
Name: numfloors, Length: 5486, dtype: bool

drop missing:

In [73]:
(
    pluto
    .dropna(subset='numfloors')
)

,borough,Tax block,Tax lot,community board,census tract 2010,cb2010,schooldist,council district,postcode,firecomp,...,landmkdate,basempdate,masdate,polidate,edesigdate,geom,dcpedited,notes,bct2020,bctcb2020
1,MN,1466,144,108,124.00,3000,2.0,5,10021.0,L016,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1012400,10124003000
2,MN,1467,1,108,124.00,2000,2.0,5,10021.0,E044,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1012400,10124002001
3,MN,1467,44,108,124.00,2000,2.0,5,10021.0,E044,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1012400,10124002001
4,MN,1467,5,108,124.00,2000,2.0,5,10021.0,E044,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1012400,10124002000
5,MN,1467,43,108,124.00,2000,2.0,5,10021.0,E044,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1012400,10124002001
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5470,MN,1475,9005,108,106.02,3000,2.0,5,10065.0,L016,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1010602,10106022001
5473,MN,1567,9021,108,144.02,2000,2.0,5,10128.0,L013,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1014402,10144022000
5482,MN,1453,25,108,134.00,3000,2.0,5,10075.0,E022,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1013400,10134003000
5484,MN,1399,27,108,120.00,2001,2.0,4,10065.0,E039,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1012000,10120002001
5485,MN,1428,41,108,126.00,1000,2.0,5,10021.0,E044,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1012602,10126021000

fill missing:

In [75]:
(
    pluto
    ['numfloors']
    .fillna(0)
)

0        0.0
1        5.0
2       20.0
3        5.0
4        6.0
        ...
5481     0.0
5482     4.0
5483     0.0
5484     4.0
5485     3.0
Name: numfloors, Length: 5486, dtype: float64